1. Import the data file from your PC.

In [ ]:
import pandas as pd
import numpy as np
df = pd.read_csv(r"D:\PYTON PROGRAMMING\PYTHON FILES\PANDAS\PANDAS-MODULE-PRACTICE\Automobile_data.csv")

3. Print first 4 rows and the last 4 rows of the data file.

In [ ]:
df.head(4)  #Prints the first 4 rows.
df.tail(4)  #Prints the last 4 rows.

4. Print company and price column only.

In [ ]:
df[['company','price']]

11. Print all the rows which have atleast one NaN value.

In [ ]:
print(df[df.isna().any(axis=1)])

12. Remove all the NaN value from the Dataframe.

In [2]:
#Remove all values here...
df.dropna(inplace=True)

13. Clean the data by capitalizing the first letter.

In [3]:
cols = ['company', 'body-style', 'num-of-cylinders', 'engine-type']
df[cols] = df[cols].apply(lambda x: x.str.strip().str.title())
df['engine-type'] = df['engine-type'].str.upper()
df.head(5)

,index,company,body-style,wheel-base,length,engine-type,num-of-cylinders,horsepower,average-mileage,price
0,0,Alfa-Romero,Convertible,88.6,168.8,DOHC,Four,111,21,13495.0
1,1,Alfa-Romero,Convertible,88.6,168.8,DOHC,Four,111,21,16500.0
2,2,Alfa-Romero,Hatchback,94.5,171.2,OHCV,Six,154,19,16500.0
3,3,Audi,Sedan,99.8,176.6,OHC,Four,102,24,13950.0
4,4,Audi,Sedan,99.4,176.6,OHC,Five,115,18,17450.0

5. Print all the cars from a perticular company which have price over 15000.

In [ ]:
df[(df['company'] == 'Alfa-Romero') & (df['price'] > 15000)]

6. Change the price of car at row 15 to 12000

In [4]:
df.loc[15,'price'] = 12000

7. Sum the entire price column.

In [ ]:
df.sum()['price']

7. Print average car price of each company.

In [ ]:
df.groupby('company')['price'].agg('mean')

8. Print number of cars from each company.

In [ ]:
df.groupby('company')['index'].count().sort_values(ascending=True)

9. Print all the car comapny that starts with A.

In [ ]:
print(df[df['company'].str.startswith('a')])

10. Arrange the data on the basis of price.

In [10]:
df.sort_values(['price'], ascending = True,inplace=True)
df.reset_index(drop=True, inplace=True)
df['index'] = df.index

13. Replace a word with another.

In [ ]:
data = df['num-of-cylinders'].replace({'Four': 'Eight'}, inplace=True)

14. Increase the price of Eight cylinders engine by 3000.

In [ ]:
def inc_price(row):
    if row['num-of-cylinders'] == 'Eight':
        row['price'] += 9563
    return row['price']
    
df['price'] = df.apply(inc_price, axis=1)

15. Increase the horsepower of the Eight cylinders engine by an amont of 82.

In [13]:
def inc_hp(row):
    if row['num-of-cylinders'] == 'Eight':
        row['horsepower'] += 82
    return row['horsepower']

df['horsepower'] = df.apply(inc_hp, axis=1)

In [ ]:
df.head(10)

16. Calculate the average price of eight cylindered engine cars.

In [ ]:
df[df['num-of-cylinders'] == 'Eight']['price'].agg('mean')

17. Calulate the average price for each number of cylinders type car.

In [ ]:
df.groupby('num-of-cylinders')['price'].agg('mean')

18. Print all the cars with rotor engine.

In [ ]:
df[df['engine-type'] == 'ROTOR']

19. Convert Rotor engine to Electric.

In [ ]:
df['engine-type'].replace({'ROTOR':'ELECTRIC'},inplace=True)

20. Increase the power of that Electric engine by 20 units.

In [ ]:
df['horsepower'] = df.apply(lambda row: row['horsepower'] + 20 if row['engine-type'] == 'ELECTRIC' else row['horsepower'], axis = 1)

21. Increase the price of the electric car by 6945.

In [23]:
df['price'] = df.apply(lambda row: row['price'] + 6945 if row['engine-type'] == "ELCTRIC" else row['price'], axis=1)

22. Add electric to the car brand suffix.

In [24]:
df['company'] = df.apply(lambda row : row['company'] + 'Elcetric' if row['engine-type'] == 'ELECTRIC' else row['company'], axis = 1)

# Filter Out value, if the same exist just before it.

In [ ]:
a = pd.DataFrame({'A' : [1,1,2,3,2,3,4,5,5,5,6,7,7]}) 
my_list = a['A'].tolist()       #This will convert the dataframe into a list.
new_list = [my_list[0]]

for i in range (1,len(my_list)):
    if my_list[i] != my_list[i-1]:
        new_list.append(my_list[i])

a = pd.DataFrame(new_list, columns=['A'])       #This will again convert the list into dataframe.
a

15. How do you subtract the row mean from each element in the row

In [ ]:
b = pd.DataFrame(np.random.random(size=(5,3)))   #creates a table of 5 row and 3 columns.
b.mean(axis=1)  #Calculates the mean of the values in the table along the rows(Axis = 1).
print(b - b.mean())

16. Suppose you have a data frame of 10 columns and 5 rows, Then print which column has the smallest sum.

In [ ]:
r = pd.DataFrame(np.random.random(size=(5,10)),columns=list('abcdefghij'))
r.sum(axis=0).idxmin()

17. How do you count how many unique rows a DataFrame has?

In [ ]:
df = pd.DataFrame(np.random.randint(0,2,size=(10,3)),index=list('abcdefghij'))
print(df)
nums = df.values.tolist()
unique_value = set(tuple(num) for num in nums)
unique_value_list = list(unique_value)
print(len(unique_value))